We utilize a module to create a workstation for each user. Here's the workstation resource:

```
resource "google_workstations_workstation" "workstation" {
  provider = google-beta
  project  = "project123"

  workstation_id = "user-workstation"
  display_name   = var.workstation_display_name

  location               = "location123"
  workstation_cluster_id = "cluster123"
  workstation_config_id  = "standard-config"

  source_workstation     = var.source_workstation # this gets set to null by default
}
```

We then created a workstation, let's say `user-workstation-copy`, that referenced `user-workstation` as the source. All of that actuated fine. However, when we created another resource in the same project, Terraform indicated a destroy and re-apply of `user-workstation-copy` in the plan.

In case it helps, here's the output of the plan that we see (scrubbing any data), noting the `forces replacement` comment:
```
  # module.user_workstation_copy.google_workstations_workstation.workstation must be replaced
-/+ resource "google_workstations_workstation" "workstation" {
-       annotations            = {} -> null
!       create_time            = "2025-02-03T23:19:34.660022974Z" -> (known after apply)
!       effective_annotations  = {} -> (known after apply)
-       env                    = {} -> null
+       host                   = (known after apply)
!       id                     = "projects/123/locations/123/workstationClusters/123/workstationConfigs/123/workstations/user-workstation-copy" -> (known after apply)
!       name                   = "user-workstation-copy" -> (known after apply)
+       source_workstation     = "user-workstation" # forces replacement
!       state                  = "STATE_STOPPED" -> (known after apply)
    }
```